# ğŸ“ 
* WAN å»£åŸŸç¶²è·¯
    * å»£åŸŸç¶²æ˜¯é€£æ¥ä¸åŒåœ°å€å±€åŸŸç¶²æˆ–è€…åŸåŸŸç¶²è¨ˆç®—æ©Ÿé€šä¿¡çš„é ç¨‹ç¶²ï¼Œæ‰€è¦†è“‹çš„åœ°å€ç¯„åœé€šå¸¸å¾ˆå¤§
* WLAN ç„¡é™å»£åŸŸç¶²è·¯
    * æ‡‰ç”¨è¶Šä¾†è¶Šå¤šï¼Œç•¶å‰æœ€å»£æ³›ä½¿ç”¨çš„ç•¶å±¬ Wi-Fi
    * åªéœ€è¦ä¸€å€‹è·¯ç”±å™¨ï¼Œå°±å¯ä»¥è®“æ‰€æœ‰å…·æœ‰ç„¡ç·šåŠŸèƒ½çš„è¨­å‚™ï¼Œçµ„æˆä¸€å€‹ç„¡ç·šå±€åŸŸç¶²ï¼Œéå¸¸æ–¹ä¾¿éˆæ´»ã€æˆæœ¬ä¹Ÿæ¯”è¼ƒä½
* LAN å€åŸŸç¶²è·¯
    * å±€åŸŸç¶²å°±æ˜¯å°ç¯„åœåœ°å€å½¢æˆçš„ä¸€å€‹å€åŸŸç¶²çµ¡ï¼Œå®ƒçš„ç‰¹é»å°±æ˜¯åˆ†ä½ˆåœ°å€ç¯„åœæœ‰è¼ƒå°
    * æ˜¯ä¸€ç¨®ç§æœ‰çš„ç¶²çµ¡ï¼Œç›¸å°å…¶ä»–å½¢å¼ç¶²çµ¡å‚³è¼¸é€Ÿåº¦æ›´å¿«ï¼Œæ€§èƒ½æ›´ç©©å®šï¼Œæ¡†æ¶æ­å»ºå®¹æ˜“
* VLAN è™›æ“¬å€åŸŸç¶²è·¯
    * è™›æ“¬å±€åŸŸç¶²æ˜¯ä¸€çµ„é‚è¼¯ä¸Šçš„è¨­å‚™å’Œç”¨æˆ¶ï¼Œé€™äº›è¨­å‚™å’Œç”¨æˆ¶äº’ä¸å—ç‰©ç†ä½ç½®çš„é™åˆ¶ï¼Œç›¸äº’ä¹‹é–“çš„é€šä¿¡å°±å¥½åƒå®ƒå€‘åœ¨åŒä¸€å€‹ç¶²æ®µ
    VLAN å¯ä»¥æŠŠä¸€å€‹å¯¦é«” LAN åˆ†å‰²æˆå¤šå€‹è™›æ“¬ LAN ä½¿ç”¨ï¼Œåˆ†å‰²å‡ºä¾†çš„ VLAN æ˜¯å„è‡ªç¨ç«‹çš„ï¼ŒVLAN èˆ‡ VLAN ä¹‹é–“äº’ç›¸ç„¡æ³•æºé€šã€‚VLAN æœ‰å…©å€‹åˆ¶å¼ï¼Œå°±æ˜¯ ISL (Inter-Switch Link) å’Œ IEEE 802.1q (ä¸‹ç¨± 802.1q)ã€‚ISL æ˜¯ Cisco å°ˆæœ‰çš„ï¼Œåªæœ‰ Cisco è¨­å‚™æ‰èƒ½è¨­å®šï¼Œ802.1q æ˜¯å…¬é–‹çš„ï¼Œæœ¬ç¯‡åªé›†ä¸­è¨è«– 802.1q

åŸæ–‡ç¶²å€ï¼šhttps://kknews.cc/code/pva3qbe.html
* VPN è™›æ“¬ç§æœ‰ç¶²è·¯
    * åœ¨å…¬ç”¨ç¶²çµ¡ä¸Šå»ºç«‹å°ˆç”¨ç§æœ‰ç¶²çµ¡ï¼Œç„¶å¾Œé€²è¡ŒåŠ å¯†é€šè¨Š
## ğŸ“– 
### ğŸ”– 
#### ğŸ‘‰ 
##### ğŸ“ 

æ“ä½œå·¥ä½œæ¨¡å¼
ä½¿ç”¨è€…æ¨¡å¼
```
Router >
```
ç‰¹æ¬ŠåŸ·è¡Œæ¨¡å¼
```
Router > en  //é€²å…¥
Router # exit   //é€€å‡º
```
æ•´é«”çµ„æ…‹æ¨¡å¼
```
Router # config
Router(config)# 
```
ç‰¹æ®Šçµ„æ…‹æ¨¡å¼
* å„ç¨®ä»‹é¢éƒ½æœ‰ä»–ç‰¹å®šçš„æ“ä½œæ¨¡å¼
* EX. Interface
```
Router(config)# int [e0/0]
Router(config-if)# 
```
å‘½ä»¤æŸ¥è©¢






```
$ en
# config
(config) int e0/0
(config-if) R1(config-if)#ip addr 192.168.1.1 255.255.255.0

R1#show ip interface
Ethernet0/0 is up, line protocol is up
  Internet address is 192.168.1.1/24
  Broadcast address is 255.255.255.255

R1#show ip int brief
Interface              IP-Address      OK? Method Status    
            Protocol
Ethernet0/0            192.168.1.1     YES manual up        
            up      
Ethernet0/1            unassigned      YES unset  administra
tively down down    
Ethernet0/2            unassigned      YES unset  administra
tively down down    
Ethernet0/3            unassigned      YES unset  administra
tively down down  

R1#show ip in brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            192.168.1.1     YES manual up                    up      
Ethernet0/1            unassigned      YES unset  administratively down down    
Ethernet0/2            unassigned      YES unset  administratively down down    
Ethernet0/3            unassigned      YES unset  administratively down down  
```

```
SW1#sh vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- ------------
-------------------
1    default                          active    Et0/0, Et0/1
, Et0/2, Et0/3
10   yellow                           active    
20   green                            active    
1002 fddi-default                     act/unsup 
1003 token-ring-default               act/unsup 
1004 fddinet-default                  act/unsup 
1005 trnet-default                    act/unsup 
```